<template>
  <svg
    class="spacex"
    xmlns="http://www.w3.org/2000/svg"
    width="341.066"
    height="41.985"
    viewBox="0 0 341.066 41.985"
  >
    <g id="SpaceX-Logo" transform="translate(0)">
      <path
        id="Tracé_92"
        data-name="Tracé 92"
        d="M78.118,15.094H49.279l-1.069.8V41.549h7.984V31.928l.762-.683H78.119c5.344,0,7.849-1.438,7.849-5.127V20.228c0-3.7-2.505-5.134-7.85-5.134m0,9.485c0,1.738-1.15,2.1-3.655,2.1H57.043l-.85-.827v-5.5l.762-.7H74.463c2.505,0,3.655.357,3.655,2.1Z"
        transform="translate(1.37 0.429)"
      />
      <path
        id="Tracé_93"
        data-name="Tracé 93"
        d="M99.429,19.956l6.87,10.065-.381.975H90.725l-3.878,4.771h22.615l1.567.954,3.511,4.843h9.136L103.65,14.775"
        transform="translate(2.467 0.42)"
      />
      <path
        id="Tracé_94"
        data-name="Tracé 94"
        d="M187.642,36.1V28.978l.822-.71h15.284V23.734H179.524V41.309h35.733V36.8H188.5"
        transform="translate(5.101 0.674)"
      />
      <rect
        id="Rectangle_36"
        data-name="Rectangle 36"
        width="36.111"
        height="4.986"
        transform="translate(184.625 15.523)"
      />
      <path
        id="Tracé_95"
        data-name="Tracé 95"
        d="M140.609,19.816H169.7c-.448-3.7-2.744-4.726-8.567-4.726H140.3c-6.571,0-8.666,1.282-8.666,6.255V35.3c0,4.978,2.1,6.26,8.666,6.26h20.835c5.908,0,8.171-1.11,8.325-4.947h-28.85l-.856-.805V20.354"
        transform="translate(3.74 0.429)"
      />
      <path
        id="Tracé_96"
        data-name="Tracé 96"
        d="M30.166,25.4H9l-.623-.686V20.19L9,19.711H37.53l.39-.953c-.972-2.5-3.488-3.666-8.161-3.666H9.94c-6.566,0-8.665,1.282-8.665,6.255v2.925c0,4.979,2.1,6.259,8.665,6.259H31.056l.663.582v4.733l-.541.738H7.024V36.56H.7s-.724.363-.7.533c.54,3.478,2.909,4.463,8.582,4.463H30.166c6.565,0,8.727-1.282,8.727-6.26V31.653c0-4.969-2.162-6.25-8.727-6.25"
        transform="translate(0 0.429)"
      />
      <path
        id="Tracé_97"
        data-name="Tracé 97"
        d="M237.071,14.988H225.192l-.645,1.227,13.192,9.617c2.5-1.447,5.218-2.913,8.176-4.36"
        transform="translate(6.38 0.426)"
      />
      <path
        id="Tracé_98"
        data-name="Tracé 98"
        d="M247.075,32.75l11.6,8.456h12.024l.5-1.12L253.878,27.413q-3.449,2.531-6.8,5.337"
        transform="translate(7.02 0.779)"
      />
      <path
        id="Tracé_99"
        data-name="Tracé 99"
        d="M235.328,41.965H224.58l-.908-1.422C230.98,33.487,263.665,3.241,334.712,0c0,0-59.634,2.012-99.384,41.965"
        transform="translate(6.355)"
      />
    </g>
  </svg>
</template>

<script>
export default {
  name: "spacex",
};
</script>

<style scoped>
.spacex {
  width: 100%;
  height: 100%;
}
</style>
